Tekla Open API Reference for Tekla Structures 2025
LoadGroup.Direction Property
 The load group direction.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LoadGroup.LoadGroupDirection Direction { get; set; }
Public Property Direction As LoadGroup.LoadGroupDirection
	Get
	Set
Property Value
Type: LoadGroup.LoadGroupDirection
See Also
Reference
LoadGroup Class
Tekla.Structures.Model Namespace